<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Boxcryptor installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.bjornbf.autopkg.munki.Boxcryptor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Boxcryptor</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>DOWNLOAD_URL</key>
        <string>https://d3k3ih5otj72mn.cloudfront.net/Boxcryptor_v2.1.441.667_Installer.dmg</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Boxcryptor protects your files in the cloud no matter if you use Dropbox, Google Drive, Microsoft OneDrive, SugarSync, Box.net, or any other major cloud storage provider. It also supports all the clouds that use the WebDAV standard such as Cubby, Strato HiDrive, and ownCloud.</string>
            <key>display_name</key>
            <string>Boxcryptor</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
        <key>MinimumVersion</key>
    <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.bjornbf.autopkg.download.Boxcryptor</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
